In [2]:
##DataFrame

#Dataset: Consider the following dataset of sales records: Order ID Customer Product Category Quantity Price Total Sales
#1001 Alice Laptop Electronics 2 800 1600
#1002 Bob Phone Electronics 1 500 500
#1003 Charlie Chair Furniture 4 100 400
#1004 Alice Table Furniture 1 250 250
#1005 David Laptop Electronics 1 800 800
#1006 Charlie Phone Electronics 2 500 1000
#1007 Bob Chair Furniture 2 100 200
#1008 Alice Phone Electronics 1 500 500

#Tasks:
#1. Create a DataFrame:
#o Load the above dataset into a Pandas DataFrame.
#2. Add a New Column:
#o Add a column Discount that gives a 10% discount on total
#sales.
#3. Add a New Row:
#o Add a new sales record: Order ID = 1009, Customer =
#"Eve", Product = "Tablet", Category = "Electronics",
#Quantity = 1, Price = 300, Total Sales = 300.

#4. Filter Data:
#o Retrieve only the sales records where the Category is
#"Electronics".

#5. Selection:
#o Select the Customer and Total Sales columns.

#6. Grouping:
#o Group the data by Customer and calculate the total sales per customer.
#7. Sorting:
#o Sort the DataFrame based on Total Sales in descending order.
#8. Apply Function:
#o Apply a lambda function to create a new column Sales Category, where values are labeled as "High" if Total Sales > 1000, otherwise "Low".

#9. Save DataFrame:
# Save the final DataFrame as a CSV file named sales_data.csv.

In [1]:
import pandas as pd

data = {
    'Order ID': [1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008],
    'Customer': ['Alice', 'Bob', 'Charlie', 'Alice', 'David', 'Charlie', 'Bob', 'Alice'],
    'Product': ['Laptop', 'Phone', 'Chair', 'Table', 'Laptop', 'Phone', 'Chair', 'Phone'],
    'Category': ['Electronics', 'Electronics', 'Furniture', 'Furniture', 'Electronics', 'Electronics', 'Furniture', 'Electronics'],
    'Quantity': [2, 1, 4, 1, 1, 2, 2, 1],
    'Price': [800, 500, 100, 250, 800, 500, 100, 500],
    'Total Sales': [1600, 500, 400, 250, 800, 1000, 200, 500]
}

df = pd.DataFrame(data)
print(df)

   Order ID Customer Product     Category  Quantity  Price  Total Sales
0      1001    Alice  Laptop  Electronics         2    800         1600
1      1002      Bob   Phone  Electronics         1    500          500
2      1003  Charlie   Chair    Furniture         4    100          400
3      1004    Alice   Table    Furniture         1    250          250
4      1005    David  Laptop  Electronics         1    800          800
5      1006  Charlie   Phone  Electronics         2    500         1000
6      1007      Bob   Chair    Furniture         2    100          200
7      1008    Alice   Phone  Electronics         1    500          500

C:\Users\Yash\AppData\Local\Temp\ipykernel_13244\3359506501.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
df['Discount'] = df['Total Sales'] * 0.10
print(df)

   Order ID Customer Product     Category  Quantity  Price  Total Sales  \
0      1001    Alice  Laptop  Electronics         2    800         1600
1      1002      Bob   Phone  Electronics         1    500          500
2      1003  Charlie   Chair    Furniture         4    100          400
3      1004    Alice   Table    Furniture         1    250          250
4      1005    David  Laptop  Electronics         1    800          800
5      1006  Charlie   Phone  Electronics         2    500         1000
6      1007      Bob   Chair    Furniture         2    100          200
7      1008    Alice   Phone  Electronics         1    500          500

   Discount
0     160.0
1      50.0
2      40.0
3      25.0
4      80.0
5     100.0
6      20.0
7      50.0

In [4]:
new_row = {
    "Order ID": 1009,
    "Customer": "Eve",
    "Product": "Tablet",
    "Category": "Electronics",
    "Quantity": 1,
    "Price": 300,
    "Total Sales": 300,
    "Discount": 300 * 0.10
}

df.loc[len(df)] = new_row
print(df)

   Order ID Customer Product     Category  Quantity  Price  Total Sales  \
0      1001    Alice  Laptop  Electronics         2    800         1600
1      1002      Bob   Phone  Electronics         1    500          500
2      1003  Charlie   Chair    Furniture         4    100          400
3      1004    Alice   Table    Furniture         1    250          250
4      1005    David  Laptop  Electronics         1    800          800
5      1006  Charlie   Phone  Electronics         2    500         1000
6      1007      Bob   Chair    Furniture         2    100          200
7      1008    Alice   Phone  Electronics         1    500          500
8      1009      Eve  Tablet  Electronics         1    300          300

   Discount
0     160.0
1      50.0
2      40.0
3      25.0
4      80.0
5     100.0
6      20.0
7      50.0
8      30.0

In [5]:
electronics_df = df[df["Category"] == "Electronics"]
electronics_df

,Order ID,Customer,Product,Category,Quantity,Price,Total Sales,Discount
0,1001,Alice,Laptop,Electronics,2,800,1600,160.0
1,1002,Bob,Phone,Electronics,1,500,500,50.0
4,1005,David,Laptop,Electronics,1,800,800,80.0
5,1006,Charlie,Phone,Electronics,2,500,1000,100.0
7,1008,Alice,Phone,Electronics,1,500,500,50.0
8,1009,Eve,Tablet,Electronics,1,300,300,30.0

In [6]:
customer_sales = df[["Customer", "Total Sales"]]
customer_sales

  Customer  Total Sales
0    Alice         1600
1      Bob          500
2  Charlie          400
3    Alice          250
4    David          800
5  Charlie         1000
6      Bob          200
7    Alice          500
8      Eve          300

In [7]:
customer_total_sales = df.groupby("Customer")["Total Sales"].sum().reset_index()
customer_total_sales

  Customer  Total Sales
0    Alice         2350
1      Bob          700
2  Charlie         1400
3    David          800
4      Eve          300

In [8]:
sorted_df = df.sort_values(by="Total Sales", ascending=False)
sorted_df

,Order ID,Customer,Product,Category,Quantity,Price,Total Sales,Discount
0,1001,Alice,Laptop,Electronics,2,800,1600,160.0
5,1006,Charlie,Phone,Electronics,2,500,1000,100.0
4,1005,David,Laptop,Electronics,1,800,800,80.0
1,1002,Bob,Phone,Electronics,1,500,500,50.0
7,1008,Alice,Phone,Electronics,1,500,500,50.0
2,1003,Charlie,Chair,Furniture,4,100,400,40.0
8,1009,Eve,Tablet,Electronics,1,300,300,30.0
3,1004,Alice,Table,Furniture,1,250,250,25.0
6,1007,Bob,Chair,Furniture,2,100,200,20.0

In [9]:
df["Sales Category"] = df["Total Sales"].apply(lambda x: "High" if x > 1000 else "Low")
df

,Order ID,Customer,Product,Category,Quantity,Price,Total Sales,Discount,Sales Category
0,1001,Alice,Laptop,Electronics,2,800,1600,160.0,High
1,1002,Bob,Phone,Electronics,1,500,500,50.0,Low
2,1003,Charlie,Chair,Furniture,4,100,400,40.0,Low
3,1004,Alice,Table,Furniture,1,250,250,25.0,Low
4,1005,David,Laptop,Electronics,1,800,800,80.0,Low
5,1006,Charlie,Phone,Electronics,2,500,1000,100.0,Low
6,1007,Bob,Chair,Furniture,2,100,200,20.0,Low
7,1008,Alice,Phone,Electronics,1,500,500,50.0,Low
8,1009,Eve,Tablet,Electronics,1,300,300,30.0,Low

In [11]:
df.to_csv("sales_data.csv", index=False)